def g():
    global l, l1, a, i, j, o, a

    l[i][j] = ' ' + o + ' '
    for i in l:
        print(*i)

    for s1 in l1:
        i3 = 0
        for s2 in s1:
            a[i3] = l[s2[0] - 1][s2[1] - 1]
            i3 += 1
        if a[0] != ' * ' and a[0] == a[1] and a[0] == a[2]:
            print(f'Выиграла линия {s1}')
            return  True

l1 = [[[1,1], [1,2], [1,3]], [[1,1], [2,1], [3,1]], [[1,1], [2,2], [3,3]], [[2,1], [2,2], [2,3]],
      [[3,1], [3,2], [3,3]], [[1,3], [2,2], [3,1]], [[1,2], [2,2], [3,2]], [[1,3], [2,3], [3,3]]]
l=[[' * ',' * ',' * '],[' * ',' * ',' * '],[' * ',' * ',' * ']]
o = 'X'
a=[0, 0, 0]
i1 = 0
while i1 <= 9:
    print(f'Ходят {o}')
    i = int(input("Введите № строки (1, 2, 3) ")) -1
    j = int(input("Введите № столбца (1, 2, 3) ")) - 1
    if l[i][j] != ' * ':
        print('Место занято. Введите другой адрес')
        continue
    i1 += 1
    if g():
        break
    if o == 'X':
        o = 'O'
    else:
        o = 'X'